"""
Regroupement de multiples tableaux

-> concaténer des tableaux : fonction concat()
-> regrouper des tableaux avec des données identiques : fonction merge()

Éditeur : Laurent REYNAUD
Date : 09-07-21
"""

In [51]:
import pandas as pd

In [52]:
 "Importation du fichier n° 1 avec récupération de certaines colonnes"

air_quality_no2 = pd.read_csv('data/air_quality_no2_long.csv', parse_dates=True)
air_quality_no2 = air_quality_no2[[
    'date.utc', 
    'location',
    'parameter',
    'value']]
air_quality_no2.head(8)

                    date.utc location parameter  value
0  2019-06-21 00:00:00+00:00  FR04014       no2   20.0
1  2019-06-20 23:00:00+00:00  FR04014       no2   21.8
2  2019-06-20 22:00:00+00:00  FR04014       no2   26.5
3  2019-06-20 21:00:00+00:00  FR04014       no2   24.9
4  2019-06-20 20:00:00+00:00  FR04014       no2   21.4
5  2019-06-20 19:00:00+00:00  FR04014       no2   25.3
6  2019-06-20 18:00:00+00:00  FR04014       no2   23.9
7  2019-06-20 17:00:00+00:00  FR04014       no2   23.2

In [53]:
" Nombre de lignes et de colonnes du tableau n° 1"
air_quality_no2.shape

(2068, 4)

In [54]:
"Importation du fichier n° 2 avec récupération de certaines colonnes"

air_quality_pm25 = pd.read_csv('data/air_quality_pm25_long.csv')
air_quality_pm25 = air_quality_pm25[[
    'date.utc',
    'location',
    'parameter',
    'value'
]]
air_quality_pm25.head(8)

                    date.utc location parameter  value
0  2019-06-18 06:00:00+00:00  BETR801      pm25   18.0
1  2019-06-17 08:00:00+00:00  BETR801      pm25    6.5
2  2019-06-17 07:00:00+00:00  BETR801      pm25   18.5
3  2019-06-17 06:00:00+00:00  BETR801      pm25   16.0
4  2019-06-17 05:00:00+00:00  BETR801      pm25    7.5
5  2019-06-17 04:00:00+00:00  BETR801      pm25    7.5
6  2019-06-17 03:00:00+00:00  BETR801      pm25    7.0
7  2019-06-17 02:00:00+00:00  BETR801      pm25    7.0

In [55]:
" Nombre de lignes et de colonnes du tableau n° 2"
air_quality_pm25.shape

(1110, 4)

In [56]:
"Concaténation des deux fichiers précédents"

# Avec axis=1, les deux fichiers sont assemblés horizontalement
air_quality = pd.concat([air_quality_pm25, air_quality_no2], axis=1)
air_quality

,date.utc,location,parameter,value,date.utc,location,parameter,value
0,2019-06-18 06:00:00+00:00,BETR801,pm25,18.0,2019-06-21 00:00:00+00:00,FR04014,no2,20.0
1,2019-06-17 08:00:00+00:00,BETR801,pm25,6.5,2019-06-20 23:00:00+00:00,FR04014,no2,21.8
2,2019-06-17 07:00:00+00:00,BETR801,pm25,18.5,2019-06-20 22:00:00+00:00,FR04014,no2,26.5
3,2019-06-17 06:00:00+00:00,BETR801,pm25,16.0,2019-06-20 21:00:00+00:00,FR04014,no2,24.9
4,2019-06-17 05:00:00+00:00,BETR801,pm25,7.5,2019-06-20 20:00:00+00:00,FR04014,no2,21.4
...,...,...,...,...,...,...,...,...
2063,NaN,NaN,NaN,NaN,2019-05-07 06:00:00+00:00,London Westminster,no2,26.0
2064,NaN,NaN,NaN,NaN,2019-05-07 04:00:00+00:00,London Westminster,no2,16.0
2065,NaN,NaN,NaN,NaN,2019-05-07 03:00:00+00:00,London Westminster,no2,19.0
2066,NaN,NaN,NaN,NaN,2019-05-07 02:00:00+00:00,London Westminster,no2,19.0
2067,NaN,NaN,NaN,NaN,2019-05-07 01:00:00+00:00,London Westminster,no2,23.0

In [57]:
"Concaténation des deux fichiers précédents"

# Avec axis=0, les deux fichiers sont assemblés verticalement
air_quality = pd.concat([air_quality_pm25, air_quality_no2], axis=0)
air_quality

                       date.utc            location parameter  value
0     2019-06-18 06:00:00+00:00             BETR801      pm25   18.0
1     2019-06-17 08:00:00+00:00             BETR801      pm25    6.5
2     2019-06-17 07:00:00+00:00             BETR801      pm25   18.5
3     2019-06-17 06:00:00+00:00             BETR801      pm25   16.0
4     2019-06-17 05:00:00+00:00             BETR801      pm25    7.5
...                         ...                 ...       ...    ...
2063  2019-05-07 06:00:00+00:00  London Westminster       no2   26.0
2064  2019-05-07 04:00:00+00:00  London Westminster       no2   16.0
2065  2019-05-07 03:00:00+00:00  London Westminster       no2   19.0
2066  2019-05-07 02:00:00+00:00  London Westminster       no2   19.0
2067  2019-05-07 01:00:00+00:00  London Westminster       no2   23.0

[3178 rows x 4 columns]

In [58]:
"Regroupement de deux tableaux avec une clé commune"

# Chargement du 1er fichier'
stations_coord = pd.read_csv('data/air_quality_stations.csv')
stations_coord

                      location  coordinates.latitude  coordinates.longitude
0                      BELAL01              51.23619                4.38522
1                      BELHB23              51.17030                4.34100
2                      BELLD01              51.10998                5.00486
3                      BELLD02              51.12038                5.02155
4                      BELR833              51.32766                4.36226
..                         ...                   ...                    ...
61             Southend-on-Sea              51.54420                0.67841
62  Southwark A2 Old Kent Road              51.48050               -0.05955
63                    Thurrock              51.47707                0.31797
64      Tower Hamlets Roadside              51.52253               -0.04216
65        Groton Fort Griswold              41.35360              -72.07890

[66 rows x 3 columns]

In [59]:
"Regroupement de deux tableaux avec une clé commune"

# Affichage de certaines lignes de ce 1er fichier
stations_coord[stations_coord['location'].isin(['BETR801', 'London Westminster'])]

              location  coordinates.latitude  coordinates.longitude
9              BETR801              51.20966                4.43182
60  London Westminster              51.49467               -0.13193

In [60]:
"Regroupement de deux tableaux avec une clé commune"

# Récupération du 2ème fichier'
air_quality

                       date.utc            location parameter  value
0     2019-06-18 06:00:00+00:00             BETR801      pm25   18.0
1     2019-06-17 08:00:00+00:00             BETR801      pm25    6.5
2     2019-06-17 07:00:00+00:00             BETR801      pm25   18.5
3     2019-06-17 06:00:00+00:00             BETR801      pm25   16.0
4     2019-06-17 05:00:00+00:00             BETR801      pm25    7.5
...                         ...                 ...       ...    ...
2063  2019-05-07 06:00:00+00:00  London Westminster       no2   26.0
2064  2019-05-07 04:00:00+00:00  London Westminster       no2   16.0
2065  2019-05-07 03:00:00+00:00  London Westminster       no2   19.0
2066  2019-05-07 02:00:00+00:00  London Westminster       no2   19.0
2067  2019-05-07 01:00:00+00:00  London Westminster       no2   23.0

[3178 rows x 4 columns]

In [61]:
"Regroupement de deux tableaux avec une clé commune"

# Ajout à droite le 1er fichier au 2ème fichier ci-dessus avec pour clé commune 'location'
air_quality = pd.merge(air_quality, stations_coord, how="left", on="location")
air_quality

,date.utc,location,parameter,value,coordinates.latitude,coordinates.longitude
0,2019-06-18 06:00:00+00:00,BETR801,pm25,18.0,51.20966,4.43182
1,2019-06-17 08:00:00+00:00,BETR801,pm25,6.5,51.20966,4.43182
2,2019-06-17 07:00:00+00:00,BETR801,pm25,18.5,51.20966,4.43182
3,2019-06-17 06:00:00+00:00,BETR801,pm25,16.0,51.20966,4.43182
4,2019-06-17 05:00:00+00:00,BETR801,pm25,7.5,51.20966,4.43182
...,...,...,...,...,...,...
4177,2019-05-07 06:00:00+00:00,London Westminster,no2,26.0,51.49467,-0.13193
4178,2019-05-07 04:00:00+00:00,London Westminster,no2,16.0,51.49467,-0.13193
4179,2019-05-07 03:00:00+00:00,London Westminster,no2,19.0,51.49467,-0.13193
4180,2019-05-07 02:00:00+00:00,London Westminster,no2,19.0,51.49467,-0.13193
4181,2019-05-07 01:00:00+00:00,London Westminster,no2,23.0,51.49467,-0.13193

In [62]:
"Regroupement de deux tableaux avec deux clés distinctes mais avec des données identiques"

# Chargement d'un nouveau fichier
air_quality_parameters = pd.read_csv("data/air_quality_parameters.csv")
air_quality_parameters

     id                                        description   name
0    bc                                       Black Carbon     BC
1    co                                    Carbon Monoxide     CO
2   no2                                   Nitrogen Dioxide    NO2
3    o3                                              Ozone     O3
4  pm10  Particulate matter less than 10 micrometers in...   PM10
5  pm25  Particulate matter less than 2.5 micrometers i...  PM2.5
6   so2                                     Sulfur Dioxide    SO2

In [63]:
"Regroupement de deux tableaux avec deux clés distinctes mais avec des données identiques"

# Ajout à gauche du nouveau fichier en liant le champ 'parameter' du 1er fichier au champ 'id' du deuxième fichier
air_quality = pd.merge(air_quality, air_quality_parameters, how='left', left_on='parameter', right_on='id')
air_quality

,date.utc,location,parameter,value,coordinates.latitude,coordinates.longitude,id,description,name
0,2019-06-18 06:00:00+00:00,BETR801,pm25,18.0,51.20966,4.43182,pm25,Particulate matter less than 2.5 micrometers i...,PM2.5
1,2019-06-17 08:00:00+00:00,BETR801,pm25,6.5,51.20966,4.43182,pm25,Particulate matter less than 2.5 micrometers i...,PM2.5
2,2019-06-17 07:00:00+00:00,BETR801,pm25,18.5,51.20966,4.43182,pm25,Particulate matter less than 2.5 micrometers i...,PM2.5
3,2019-06-17 06:00:00+00:00,BETR801,pm25,16.0,51.20966,4.43182,pm25,Particulate matter less than 2.5 micrometers i...,PM2.5
4,2019-06-17 05:00:00+00:00,BETR801,pm25,7.5,51.20966,4.43182,pm25,Particulate matter less than 2.5 micrometers i...,PM2.5
...,...,...,...,...,...,...,...,...,...
4177,2019-05-07 06:00:00+00:00,London Westminster,no2,26.0,51.49467,-0.13193,no2,Nitrogen Dioxide,NO2
4178,2019-05-07 04:00:00+00:00,London Westminster,no2,16.0,51.49467,-0.13193,no2,Nitrogen Dioxide,NO2
4179,2019-05-07 03:00:00+00:00,London Westminster,no2,19.0,51.49467,-0.13193,no2,Nitrogen Dioxide,NO2
4180,2019-05-07 02:00:00+00:00,London Westminster,no2,19.0,51.49467,-0.13193,no2,Nitrogen Dioxide,NO2
4181,2019-05-07 01:00:00+00:00,London Westminster,no2,23.0,51.49467,-0.13193,no2,Nitrogen Dioxide,NO2